2019/quick-sort.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-10-31 四 11:27 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Quick Sort 快速排序算法</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">
<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Quick Sort 快速排序算法</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org65741d0">1. 前言</a></li>
<li><a href="#org459139b">2. 算法步骤</a></li>
<li><a href="#org8b86b1e">3. 选取枢纽元</a></li>
<li><a href="#org78c9f26">4. 分割数组</a></li>
<li><a href="#orgd5affe8">5. 算法实现</a></li>
<li><a href="#org647240c">6. 小数组和插入排序</a></li>
<li><a href="#orgb114ed1">7. 结语</a></li>
</ul>
</div>
</div>

<div id="outline-container-org65741d0" class="outline-2">
<h2 id="org65741d0"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
快速排序算法应该是常见的排序算法中使用的最多的一个，很多语言内置的排序算法都间接或直接的使用了这一算法。
</p>

<p>
因此，我们是很有必要学习快速排序算法的。
</p>
</div>
</div>

<div id="outline-container-org459139b" class="outline-2">
<h2 id="org459139b"><span class="section-number-2">2</span> 算法步骤</h2>
<div class="outline-text-2" id="text-2">
<p>
在了解详细的算法步骤之前可以先来看一下快速排序算法的算法复杂度：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">时间复杂度（平均）</th>
<th scope="col" class="org-left">时间复杂度（最坏）</th>
<th scope="col" class="org-left">空间复杂度</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">\(O(nlog_2n)\)</td>
<td class="org-left">\(O(n^2)\)</td>
<td class="org-left">\(O(1)\)</td>
</tr>
</tbody>
</table>

<p>
通过快速排序算法的算法复杂度我们可以猜测它可能是一种 <b>分治</b> 算法，而事实也是如此。
</p>

<p>
当通过快速排序算法对数组 \(A\) 进行排序时，我们需要递归的将其分为不同的部分进行处理，其基本步骤为：
</p>
<ol class="org-ol">
<li>如果数组 \(A\) 中的元素个数为 1 或 0 时，就直接返回</li>
<li>选择数组 \(A\) 中的任一元素 \(P\) 作为 <b>枢纽元</b></li>
<li>将数组 \(A\) 中的元素分为两个部分：所有元素 <b>小于等于</b> \(P\) 的部分 \(A_1\) 和所有元素 <b>大于等于</b> \(P\) 的部分 \(A_2\)</li>
<li>返回 [\(QuickSort(A_1)\), \(P\), \(QuickSort(A_2)\)]</li>
</ol>

<p>
可以看到，快速排序算法的基本步骤并不难，实现这个算法主要需要考虑的问题便是 <b>枢纽元</b> 的选取和 <b>怎样分割</b> 数组。
</p>
</div>
</div>

<div id="outline-container-org8b86b1e" class="outline-2">
<h2 id="org8b86b1e"><span class="section-number-2">3</span> 选取枢纽元</h2>
<div class="outline-text-2" id="text-3">
<p>
常见的枢纽元选择方式大概就是选择数组 <b>中间</b> 的那个元素，简单直接有效。
</p>

<p>
在选取枢纽元后，通常需要对两端和枢纽元处的值进行排序，这样可以稍稍提高算法的效率并避免一些意外情况<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">int</span> <span class="org-function-name">selectPivot</span>(<span class="org-type">int</span>[] <span class="org-variable-name">arr</span>, <span class="org-type">int</span> <span class="org-variable-name">left</span>, <span class="org-type">int</span> <span class="org-variable-name">right</span>) {  <span class="org-comment-delimiter">// </span><span class="org-comment">&#21253;&#21547;&#21491;&#36793;&#30028;</span>
  <span class="org-type">int</span> <span class="org-variable-name">mid</span> = (left + right) / 2;

  <span class="org-keyword">if</span> (arr[left] &gt; arr[mid]) {
    swap(arr, left, mid);
  }

  <span class="org-keyword">if</span> (arr[left] &gt; arr[right]) {
    swap(arr, left, right);
  }

  <span class="org-keyword">if</span> (arr[mid] &gt; arr[right]) {
    swap(arr, mid, right);
  }

  <span class="org-comment-delimiter">/* </span><span class="org-comment">arr[left] &lt;= arr[mid] &lt;= arr[right] */</span>

  swap(arr, mid, right - 1);

  <span class="org-keyword">return</span> arr[right - 1];
}
</pre>
</div>

<p>
在将两端和枢纽元处的值排序后，最左端的值必然是小于等于枢纽元处的值的，最右端的值必然是大于等于枢纽元处的值的，这时，我们需要分割的数组便变成了 <code>[left + 1, right - 1]</code>.
</p>

<p>
然后，交换枢纽元和 <code>right - 1</code> 处的元素，使得枢纽元离开要被分割的数组<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>，这时，我们需要分割的数组便变成了 <code>[left + 1, right - 2]</code>.
</p>

<p>
介绍完了常用的做法，这里在介绍一种不常用的做法和一种常见的错误做法：
</p>
<ul class="org-ul">
<li>随机选取枢纽元是一种不常用的做法，因为随机数的生成成本相较于中值的计算成本要昂贵的多</li>
<li>直接选取第一个元素作为枢纽元是一种常见的错误做法，当输入的数组是预排序的时，会让所有元素都分配到单个组中，并不断递归，使得时间复杂度变成 \(O(n^2)\)</li>
</ul>
</div>
</div>

<div id="outline-container-org78c9f26" class="outline-2">
<h2 id="org78c9f26"><span class="section-number-2">4</span> 分割数组</h2>
<div class="outline-text-2" id="text-4">
<p>
分割数组时，需要首先将选取的枢纽元和末端的元素交换位置，然后从左向右遍历所有小于枢纽元的元素，从右向左遍历所有大于枢纽元的元素，当两者遇到大于或小于枢纽元的元素停下时，便交换遇到的元素，然后继续遍历，直到交错：
</p>
<pre class="example">
        初始状态：
            8  1  4  9  0  3  5  2  7  6
            i                       j  p

        交换前：
            8  1  4  9  0  3  5  2  7  6
            i                    j     p

        交换后：
            2  1  4  9  0  3  5  8  7  6
            i                    j     p
</pre>

<p>
交错后便将 <code>i</code> 处的元素和末端的枢纽元相交换，此时，枢纽元左边的元素都小于等于它，右边的元素都大于等于它：
</p>
<pre class="example">
        交错后：
            2  1  4  5  0  3  9  8  7  6
                           j  i        p

        交换后：
            2  1  4  5  0  3  6  8  7  9
                              i        p
</pre>

<p>
遍历过程中需要考虑的一个问题是：遇到和枢纽元相等的元素怎么处理？是都停止还是都不停止？
</p>

<p>
假设输入的元素都相等，我们来看一下两种策略最后可能的情况：
</p>
<pre class="example">
        都停止：
            8  8  8  8  8  8  8  8  8
                     j  i           p

        都不停止：
            8  8  8  8  8  8  8  8  8
            i                    j  p
</pre>

<p>
可以看到，采用都停止的策略时，虽然会产生一些不必要的交换，但是都不停止的话，数组的分割便会极为的不均衡，这会使得时间复杂度很高。
</p>

<p>
因此，更好的选择是在遇到和枢纽元相等的元素后都停下来。
</p>
</div>
</div>

<div id="outline-container-orgd5affe8" class="outline-2">
<h2 id="orgd5affe8"><span class="section-number-2">5</span> 算法实现</h2>
<div class="outline-text-2" id="text-5">
<p>
在确定了枢纽元的选取方法和数组的分割策略后，就可以尝试实现快速排序算法了：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">quickSort</span>(<span class="org-type">int</span>[] <span class="org-variable-name">arr</span>) {
  quickSort(arr, 0, arr.length - 1);
}

<span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">quickSort</span>(<span class="org-type">int</span>[] <span class="org-variable-name">arr</span>, <span class="org-type">int</span> <span class="org-variable-name">left</span>, <span class="org-type">int</span> <span class="org-variable-name">right</span>) {  <span class="org-comment-delimiter">// </span><span class="org-comment">&#21253;&#21547;&#21491;&#36793;&#30028;</span>
  <span class="org-keyword">if</span>  (left &gt;= right) {  <span class="org-comment-delimiter">// </span><span class="org-comment">&#20803;&#32032;&#23567;&#20110;&#31561;&#20110; 1 &#20010;</span>
    <span class="org-keyword">return</span>;
  }

  <span class="org-type">int</span> <span class="org-variable-name">i</span> = left, <span class="org-variable-name">j</span> = right - 1, <span class="org-variable-name">pivot</span> = selectPivot(arr, left, right);

  <span class="org-keyword">while</span> (i &lt; <span class="org-type">j</span>) {
    <span class="org-keyword">while</span> (arr[++i] &lt; pivot) {}
    <span class="org-keyword">while</span> (arr[--j] &gt; pivot) {}

    <span class="org-keyword">if</span> (i &lt; <span class="org-type">j</span>) {
      swap(arr, i, j) ;
    }
  }

  swap(arr, i, right - 1);

  quickSort(arr, left, i - 1);
  quickSort(arr, i + 1, right);
}

<span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">int</span> <span class="org-function-name">selectPivot</span>(<span class="org-type">int</span>[] <span class="org-variable-name">arr</span>, <span class="org-type">int</span> <span class="org-variable-name">left</span>, <span class="org-type">int</span> <span class="org-variable-name">right</span>) {
  <span class="org-type">int</span> <span class="org-variable-name">mid</span> = (left + right) / 2;

  <span class="org-keyword">if</span> (arr[left] &gt; arr[mid]) {
    swap(arr, left, mid);
  }

  <span class="org-keyword">if</span> (arr[left] &gt; arr[right]) {
    swap(arr, left, right);
  }

  <span class="org-keyword">if</span> (arr[mid] &gt; arr[right]) {
    swap(arr, mid, right);
  }

  <span class="org-comment-delimiter">/* </span><span class="org-comment">arr[left] &lt;= arr[mid] &lt;= arr[right] */</span>

  swap(arr, mid, right - 1);

  <span class="org-keyword">return</span> arr[right - 1];
}

<span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">swap</span>(<span class="org-type">int</span>[] <span class="org-variable-name">arr</span>, <span class="org-type">int</span> <span class="org-variable-name">i</span>, <span class="org-type">int</span> <span class="org-variable-name">j</span>) {
  <span class="org-type">int</span> <span class="org-variable-name">tmp</span> = arr[i];
  arr[i] = arr[j];
  arr[j] = tmp;
}
</pre>
</div>

<p>
算法的实现并不是很难，但是需要注意的一段代码是：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">while</span> (i &lt; <span class="org-type">j</span>) {
  <span class="org-keyword">while</span> (arr[++i] &lt; pivot) {}
  <span class="org-keyword">while</span> (arr[--j] &gt; pivot) {}

  <span class="org-keyword">if</span> (i &lt; <span class="org-type">j</span>) {
    swap(arr, i, j) ;
  }
}
</pre>
</div>

<p>
假如将这段代码修改为如下形式，会使得在遇到 <code>arr[i] = arr[j] = pivot</code> 的情况后陷入死循环：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">while</span> (i &lt; <span class="org-type">j</span>) {
  <span class="org-keyword">while</span> (arr[i] &lt; pivot) {i++;}
  <span class="org-keyword">while</span> (arr[j] &gt; pivot) {j--;}

  <span class="org-keyword">if</span> (i &lt; <span class="org-type">j</span>) {
    swap(arr, i, j) ;
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org647240c" class="outline-2">
<h2 id="org647240c"><span class="section-number-2">6</span> 小数组和插入排序</h2>
<div class="outline-text-2" id="text-6">
<p>
快速排序在小数组上的表现还不如插入排序好，因此，在实现快速排序时，常常还会通过插入排序来排序较小的数组，比如说 <a href="https://github.com/exsourcode/jdk8u-jdk/blob/master/src/share/classes/java/util/DualPivotQuicksort.java#L214">OpenJDK</a> 中的实现便是这样的。
</p>

<p>
改进后的实现如下：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">insertSort</span>(<span class="org-type">int</span>[] <span class="org-variable-name">arr</span>, <span class="org-type">int</span> <span class="org-variable-name">left</span>, <span class="org-type">int</span> <span class="org-variable-name">right</span>) {  <span class="org-comment-delimiter">// </span><span class="org-comment">&#21253;&#21547;&#21491;&#36793;&#30028;</span>
  <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">p</span> = left + 1; p &lt;= right; p++) {
    <span class="org-type">int</span> <span class="org-variable-name">tmp</span> = arr[p];
    <span class="org-keyword">for</span> (<span class="org-type">int</span> <span class="org-variable-name">j</span> = p; j &gt; left &amp;&amp; arr[j - 1] &gt; tmp; j--) {
      arr[j] = arr[j - 1];
    }
    arr[j] = tmp;
  }
}

<span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">quickSort</span>(<span class="org-type">int</span>[] <span class="org-variable-name">arr</span>) {
  quickSort(arr, 0, arr.length - 1);
}

<span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">quickSort</span>(<span class="org-type">int</span>[] <span class="org-variable-name">arr</span>, <span class="org-type">int</span> <span class="org-variable-name">left</span>, <span class="org-type">int</span> <span class="org-variable-name">right</span>) {
  <span class="org-keyword">if</span>  (left + 20 &gt;= right) {  <span class="org-comment-delimiter">// </span><span class="org-comment">&#23567;&#25968;&#32452;</span>
    insertSort(arr, left, right);
    <span class="org-keyword">return</span>;
  }

  <span class="org-type">int</span> <span class="org-variable-name">i</span> = left, <span class="org-variable-name">j</span> = right - 1, <span class="org-variable-name">pivot</span> = selectPivot(arr, left, right);

  <span class="org-keyword">while</span> (i &lt; <span class="org-type">j</span>) {
    <span class="org-keyword">while</span> (arr[++i] &lt; pivot) {}
    <span class="org-keyword">while</span> (arr[--j] &gt; pivot) {}

    <span class="org-keyword">if</span> (i &lt; <span class="org-type">j</span>) {
      swap(arr, i, j) ;
    }
  }

  swap(arr, i, right - 1);

  quickSort(arr, left, i - 1);
  quickSort(arr, i + 1, right);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb114ed1" class="outline-2">
<h2 id="orgb114ed1"><span class="section-number-2">7</span> 结语</h2>
<div class="outline-text-2" id="text-7">
<p>
这篇博客的大部分内容都来源于《数据结构和算法分析 —— C 语言描述》一书的 <i>7.7</i> 节，有兴趣的可以看一看 @_@
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">&#33050;&#27880;: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
意外情况可以参考《数据结构和算法分析 —— C 语言描述》一书中的习题 <i>7.38</i>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
我并没有得到这种做法的原因和解释，只知道这种做法可以让数组的分割更加安全（避免出错或低效）
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
